performance-tests/jmeter/checkin-concurrency-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <!-- KẾ HOẠCH KIỂM THỬ (TEST PLAN): Đánh giá xử lý đụng độ Check-in -->
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan - Checkin Concurrency">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <!-- Chạy tuần tự: Setup Thread Group chạy xong mới tới Main Thread Group -->
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="Biến toàn cục (Global Variables)">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">5013</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      
      <!-- ================================================================= -->
      <!-- GIAI ĐOẠN 1: SETUP (Chuẩn bị Dữ liệu Test)                        -->
      <!-- Mục tiêu: Đăng nhập hệ thống và lấy 1 mã QR hợp lệ duy nhất       -->
      <!-- ================================================================= -->
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="1. setUp - Login &amp; Get QR">
        <intProp name="ThreadGroup.num_threads">1</intProp> <!-- Chỉ cần 1 User để lấy dữ liệu -->
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController">
          <intProp name="LoopController.loops">1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </SetupThreadGroup>
      <hashTree>
        
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Cấu hình HTTP Header chung">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <!-- Yêu cầu 1: Đăng nhập lấy JWT Token -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST - Lấy JWT Token (Login)">
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/Users/authenticate</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <stringProp name="Argument.value">{ 
  "username": "staff01", 
  "password": "123456" 
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- Trích xuất Token từ Response Body -->
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor - Token">
            <stringProp name="JSONPostProcessor.referenceNames">EXTRACTED_TOKEN</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.token</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">NOT_FOUND</stringProp>
          </JSONPostProcessor>
          <hashTree/>
        </hashTree>

        <!-- Yêu cầu 2: Gọi API lấy mã QR chưa sử dụng -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET - Lấy QR Code chưa sử dụng">
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/Tickets/get-unused-qr-for-test</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- Gắn JWT Token vào Header để xác thực -->
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Xác thực (Authorization Header)">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${EXTRACTED_TOKEN}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <!-- Trích xuất nội dung mã QR -->
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor - QR Payload">
            <stringProp name="JSONPostProcessor.referenceNames">EXTRACTED_QR</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.qrPayload</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">FALLBACK_QR_CODE</stringProp>
          </JSONPostProcessor>
          <hashTree/>
        </hashTree>

        <!-- Đẩy các biến nội bộ lên mức Toàn cục (Global) để Thread Group chính có thể sử dụng -->
        <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="Xuất biến toàn cục (Export Properties)">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">
            props.put("GLOBAL_TOKEN", vars.get("EXTRACTED_TOKEN"));
            props.put("GLOBAL_QR", vars.get("EXTRACTED_QR"));
          </stringProp>
        </JSR223PostProcessor>
        <hashTree/>
      </hashTree>

      <!-- ================================================================= -->
      <!-- GIAI ĐOẠN 2: THỰC THI KIỂM THỬ TẢI TRỌNG (Concurrency Execution)  -->
      <!-- Mục tiêu: Giả lập 100 nhân viên quét cùng 1 mã QR tại 1 thời điểm -->
      <!-- ================================================================= -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="2. Main - 100 Concurrent Check-ins">
        <intProp name="ThreadGroup.num_threads">100</intProp> <!-- Số lượng User đồng thời -->
        <intProp name="ThreadGroup.ramp_time">2</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">1</intProp> <!-- Mỗi User chỉ gửi 1 request -->
        </elementProp>
      </ThreadGroup>
      <hashTree>
        
        <!-- Cấu hình Header chứa Token đã lấy từ Giai đoạn 1 -->
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${__P(GLOBAL_TOKEN)}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        
        <!-- COMPONENT QUAN TRỌNG NHẤT: Đồng bộ hóa các luồng (Sync Timer) -->
        <!-- Đợi đủ 100 threads sẵn sàng rồi mới bắn request cùng 1 mili-giây -->
        <SyncTimer guiclass="TestBeanGUI" testclass="SyncTimer" testname="Synchronizing Timer (Ép lỗi Race Condition)">
          <intProp name="groupSize">100</intProp>
          <longProp name="timeoutInMs">5000</longProp>
        </SyncTimer>
        <hashTree/>

        <!-- Bắn phá API Check-in với cùng 1 mã QR -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST - Quét mã vào cổng (Checkin Scan)">
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/Checkin/scan</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <stringProp name="Argument.value">{ 
                  "qrPayload": "${__P(GLOBAL_QR)}", 
                  "peopleCount": 1, 
                  "gateName": "Cổng chính - Lối vào 1" 
                }</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <!-- Bổ sung Groovy script để ghi log ra Terminal -->
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="In Lỗi Check-in ra Terminal" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">
            // Lấy HTTP Status Code từ request
            String statusCode = prev.getResponseCode();

            // Kiểm tra nếu request KHÔNG thành công (khác 200)
            if (!statusCode.equals(&quot;200&quot;)) {
                // Trích xuất Response Body
                String responseBody = prev.getResponseDataAsString();
                
                // In trực tiếp ra Terminal (System.out)
                System.out.println(&quot;\n========== LỖI CHECK-IN TỪ BACKEND ==========&quot;);
                System.out.println(&quot;Status Code: &quot; + statusCode);
                System.out.println(&quot;Response JSON: &quot; + responseBody);
                System.out.println(&quot;=============================================\n&quot;);
            }
            </stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PostProcessor>
        </hashTree>

      </hashTree>

    </hashTree>
  </hashTree>
</jmeterTestPlan>