performance-tests/jmeter/html-report/statistics.json
{
  "POST - Login" : {
    "transaction" : "POST - Login",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6624.0,
    "medianResTime" : 6624.0,
    "minResTime" : 6624.0,
    "maxResTime" : 6624.0,
    "pct1ResTime" : 6624.0,
    "pct2ResTime" : 6624.0,
    "pct3ResTime" : 6624.0,
    "throughput" : 0.15096618357487923,
    "receivedKBytesPerSec" : 0.11838461465881643,
    "sentKBytesPerSec" : 0.03611983884359903
  },
  "POST - Checkin Scan" : {
    "transaction" : "POST - Checkin Scan",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 443.24000000000007,
    "medianResTime" : 424.0,
    "minResTime" : 344.0,
    "maxResTime" : 942.0,
    "pct1ResTime" : 500.70000000000005,
    "pct2ResTime" : 527.3999999999999,
    "pct3ResTime" : 941.81,
    "throughput" : 105.26315789473684,
    "receivedKBytesPerSec" : 32.21217105263158,
    "sentKBytesPerSec" : 78.33059210526316
  },
  "GET - Fetch Unused QR" : {
    "transaction" : "GET - Fetch Unused QR",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1619.0,
    "medianResTime" : 1619.0,
    "minResTime" : 1619.0,
    "maxResTime" : 1619.0,
    "pct1ResTime" : 1619.0,
    "pct2ResTime" : 1619.0,
    "pct3ResTime" : 1619.0,
    "throughput" : 0.6176652254478073,
    "receivedKBytesPerSec" : 0.1314951358863496,
    "sentKBytesPerSec" : 0.36311959542927735
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 102,
    "errorCount" : 100,
    "errorPct" : 98.039215,
    "meanResTime" : 515.3627450980393,
    "medianResTime" : 425.0,
    "minResTime" : 344.0,
    "maxResTime" : 6624.0,
    "pct1ResTime" : 506.6,
    "pct2ResTime" : 859.9999999999978,
    "pct3ResTime" : 6473.849999999994,
    "throughput" : 7.04955421936554,
    "receivedKBytesPerSec" : 2.183885051662174,
    "sentKBytesPerSec" : 5.200166627790448
  }
}